print('Входные данные:')
N  = int(input())

print('Вывод программы:')
print(2**N)
