print('Входные данные:')
name = input()

print('Вывод программы:')
print('Hello,', name, sep=' ', end='!')
