"""
Дан список чисел. Выведите все элементы списка, которые больше
предыдущего элемента.

Формат ввода

Вводится список чисел. Все числа списка находятся на одной строке.

Формат вывода

Выведите ответ на задачу.

"""
"""
Тест 1
Входные данные:
1 5 2 4 3

Вывод программы:
5 4



Тест 2
Входные данные:
1 2 3 4 5

Вывод программы:
2 3 4 5



Тест 3
Входные данные:
5 4 3 2 1

Вывод программы:
"""
a = list(map(int, input().split()))
otv = list()

for i in range(1, len(a)):
    if a[i] > a[i - 1]:
        print(a[i], end=' ')
