print('Входные данные:')
N = int(input())

print('Вывод программы:')
print(N//10)
