print('Входные данные:')
n = int(input())
k = int(input())

print('Вывод программы:')
print(k//n)
