"""
Даны два действительных числа x и y. Проверьте, принадлежит ли точка
с координатами(x,y) заштрихованному квадрату (включая его границу).
Если точка принадлежит квадрату, выведите слово YES,иначе выведите слово NO.
На рисунке сетка проведена с шагом 1.


Решение должно содержать функцию IsPointInSquare(x, y), возвращающую True,
если точка принадлежит квадрату и False, если не принадлежит.
Основная программа должна считать координаты точки, вызвать функцию
IsPointInSquareи в зависимости от возвращенного значения вывести
на экран необходимое сообщение.

Функция IsPointInSquare не должна содержать инструкцию if.

Формат ввода

Вводятся два действительных числа.

Формат вывода

Выведите ответ на задачу.

"""
"""
Тест 1
Входные данные:
0
0

Вывод программы:
YES



Тест 2
Входные данные:
1
1

Вывод программы:
NO



Тест 3
Входные данные:
-1
-1

Вывод программы:
NO
"""
"""
DPast
10 месяцев назад
"""


def IsPointInSquare(x, y):
    return abs(x) + abs(y) <= 1


x, y = float(input()), float(input())

if IsPointInSquare(x, y):
    print('YES')
else:
    print('NO')
