print('Входные данные:')
N = int(input())

print('Вывод программы:')
print(N//100 + (N%100)//10 + N%10)
