"""
Дана строка. Удалите из нее все символы, чьи индексы
делятся на 3.Символы строки нумеруются, начиная с нуля.

Формат ввода

Вводится строка.

Формат вывода

Выведите ответ на задачу.

Примечания

Ввод и вывод осуществлять с помощью файлов

Примеры

"""
"""
Тест 1
Входные данные:
Python

Вывод программы:
yton



Тест 2
Входные данные:
Hello

Вывод программы:
elo



Тест 3
Входные данные:
qwer

Вывод программы:
we
"""
"""
Шибаев Александр Евгеньевич
год назад
"""
s, i = str(input()), 0

while len(s) > i:
    if i % 3 != 0:
        print(s[i], end="")
    i += 1
