print('Входные данные:')
N = int(input())

print('Вывод программы:')
print((N//60)%24, N%60)
